/* Status text for queued multi-part archives */
"%@ (+%d more)" = "%1$@ (+%2$d kvar)";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the file \"%@\" from the archive \"%@\": %@" = "Kunde inte packa upp \"%1$@\" från arkivet \"%2$@\": %3$@";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the resource fork for the file \"%@\" from the archive \"%@\":\n%@" = "Kunde inte packa upp resursdelen för filen \"%1$@\" från arkivet \"%2$@\":\n%3$@";

/* Option in the password encoding pop-up to use the default encoding */
"Default encoding" = "Förvald kodning";

/* Option in the encoding pop-up to detect the encoding automatically */
"Detect automatically" = "Upptäck automatiskt";

/* Panel OK button title when choosing an unarchiving destination for an archive */
"Extract" = "Packa upp";

/* Panel title when choosing an unarchiving destination for an archive */
"Extract Archive" = "Packa upp arkiv";

/* Status text while extracting an archive */
"Extracting \"%@\"" = "Packar upp \"%@\"";

/* Status text when preparing to extract an archive */
"Preparing to extract \"%@\"" = "Förbereder att packa upp \"%@\"";

/* Panel OK button title when choosing a default unarchiving destination */
"Select" = "Välj";

/* Panel title when choosing archives to extract */
"Select files to unarchive" = "Välj filer att packa upp";

/* Error message for files not extractable by The Unarchiver */
"The contents of the file \"%@\" can not be extracted with this program." = "Innehållet i \"%@\" kan inte packas upp av The Unarchiver.";

/* Error message when encountering an error while extracting entries */
"There was a problem while extracting the contents of the file \"%@\": %@" = "Det gick inte att packa upp innehållet i \"%1$@\": %2$@";

/* Error message when encountering an error while parsing an archive */
"There was a problem while reading the contents of the file \"%@\": %@" = "Det gick inte att läsa innehållet i \"%1$@\": %2$@";

/* Panel OK button title when choosing archives to extract */
"Unarchive" = "Packa upp";

/* Status text when asking for a password */
"You need to supply a password to open the archive \"%@\"." = "Arkivet \"%@\" kräver ett lösenord innan det kan öppnas.";

/* Title for nagging alert on first startup */
"Where should The Unarchiver extract archives?" = "Vart ska The Unarchiver packa upp arkiven?";

/* Content of nagging alert on first startup */
"Would you like The Unarchiver to extract archives to the same folder as the archive file, or would you prefer to be asked for a destination folder for every individual archive?" = "Packa alltid upp till samma mapp, eller ska appen be dig välja målmapp varje gång.";

/* Button to ask every time in nagging alert on first startup */
"Ask every time" = "Fråga varje gång";

/* Button to extract to the same folder in nagging alert on first startup */
"Extract to the same folder" = "Packa upp till samma mapp";

/* Informative text in the file panel shown when trying to gain sandbox access */
"The Unarchiver does not have permission to write to this folder. To allow The Unarchiver to write to this folder, simply click \"Extract\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "The Unarchiver behöver ditt tillstånd för att spara de uppackade filerna till den valda mappen. Godkänn åtgärden genom att klicka på \"Packa upp\".";

/* Informative text in the file panel shown when trying to gain sandbox access for multi-part archives */
"The Unarchiver needs to search for more parts of this archive, but does not have permission to read the folder. To allow The Unarchiver to search in this folder, simply click \"Search\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "The Unarchiver behöver ditt tillstånd för att söka efter andra delar av det valda arkivet på denna plats. Godkänn åtgärden genom att klicka på \"Sök\".";

/* Panel OK button title when searching for more archive parts */
"Search" = "Sök";

/* Check for updates menu item */
"Check for Updates…" = "Leta efter uppdarteringar…";

/* Error messages from XADMaster.framework. Some are converted to friendlier messages in English, too. */
/* Common errors */

"Attempted to read more data than was available" = "Arkivfilen är inte komplett";
"Opening file failed" = "Filen kunde inte öppnas";
"Missing or wrong password" = "Fel lösenord";
"Wrong checksum" = "Arkivfilen är skadad";
"Could not create directory" = "Kunde inte skapa mapp";

/* Uncommon or unused errors */
"Unknown error" = "Okänt fel";
"Failed to write to file" = "Kunde inte skriva till filen";
"Function called with illegal parameters" = "Funktionen anropades med otillåtna parametrar";
"Not enough memory available" = "Det finns inte tillräckligt med minne";
"Data is corrupted" = "Korrupta data";
"File is not fully supported" = "Filformatet stöds inte till fullo";
"Required resource missing" = "Krävd resurs saknas";
"Error on decrunching" = "Fel vid hopslagning";
"Unknown file type" = "Okänd filtyp";
"File, disk has been skipped" = "Fil, skiva hoppades över";
"User cancelled extraction" = "Användaren avbröt uppackningen";
"File already exists" = "Filen finns redan";
"Verify failed (disk hook)" = "Verifiering misslyckades (fel från skivan)";
"Wrong drive geometry" = "Felaktig skivgeometri";
"Unknown data format" = "Okänt dataformat";
"Source contains no files" = "Källan innehåller inga filer";
"Unknown filesystem" = "Okänt filsystem";
"Name of file exists as directory" = "Filnamnet används redan på en mapp";
"Buffer was too short" = "Bufferten är för kort";
"Text encoding was defective" = "Felaktig textkodning";
"Could not create symlink" = "Kunde inte skapa symbolisk länk";

"AlertTitle_SetFileTypeAssociationAppStore" = "Gör gärna The Unarchiver till den förvalda appen för valda filtyper.";
"AlertDescription_SetFileTypeAssociationAppStore" = "Klicka på \"Visa info\" i filens snabbmeny och välj The Unarchiver i listan \"Öppna med\". Klicka på \"Ändra alla\" om det ska gälla för alla andra arkiv av samma typ.";

"AlertTitle_UnsetFileTypeAssociationAppStore" = "Ange en annan app som den förvalda appen för valda filtyper om du vill.";
"AlertDescription_UnsetFileTypeAssociationAppStore" = "Klicka på \"Visa info\" i filens snabbmeny och välj önskad app i listan \"Öppna med\". Klicka på \"Ändra alla\" om det ska gälla för alla andra arkiv av samma typ.";

/* About window */
"Standalone" = "Fristående";

/* Extracted view */
"extracted" = "packades upp";
